ElectronicCats/Arduino_Boards_Index/electroniccats/samd_advanced/boards.txt
electroniccats_meow_meow.name=Electronic Cats Meow Meow
electroniccats_meow_meow.vid.0=0x1209
electroniccats_meow_meow.pid.0=0xBAB1
electroniccats_meow_meow.vid.1=0x1209
electroniccats_meow_meow.pid.1=0xBAB1
electroniccats_meow_meow.upload.tool=bossac
electroniccats_meow_meow.upload.protocol=sam-ba
electroniccats_meow_meow.upload.maximum_size=253952
electroniccats_meow_meow.upload.offset=0x2000
electroniccats_meow_meow.upload.use_1200bps_touch=true
electroniccats_meow_meow.upload.wait_for_upload_port=true
electroniccats_meow_meow.upload.native_usb=true
electroniccats_meow_meow.build.mcu=cortex-m0plus
electroniccats_meow_meow.build.mathlib=arm_cortexM0l_math
electroniccats_meow_meow.build.f_cpu=48000000L
electroniccats_meow_meow.build.usb_product="Meow Meow"
electroniccats_meow_meow.build.usb_manufacturer="Electronic Cats"
electroniccats_meow_meow.build.board=meow_meow
electroniccats_meow_meow.build.core=arduino
electroniccats_meow_meow.build.extra_flags=-DCRYSTALLESS -DARDUINO_SAMD_ZERO -D__SAMD21G18A__ -DARM_MATH_CM0PLUS {build.usb_flags}
electroniccats_meow_meow.build.ldscript=flash_256KB.ld
electroniccats_meow_meow.build.openocdscript=openocd_scri
electroniccats_meow_meow.build.variant_system_lib=
electroniccats_meow_meow.build.vid=0x1209
electroniccats_meow_meow.build.pid=0xBAB1
electroniccats_meow_meow.bootloader.tool=openocdpts/SAMD21G15A.cfg
electroniccats_meow_meow.build.variant=meow_meow
electroniccats_meow_meow.bootloader.file=meow_meow/bootloader-meowmeow-v2.0.0.bin
electroniccats_meow_meow.menu.float.default=Print & String use auto-promoted doubles only
electroniccats_meow_meow.menu.float.default.build.floatconfig=FLOAT_BOTH_DOUBLES_ONLY
electroniccats_meow_meow.menu.float.print=Print uses separate singles and doubles
electroniccats_meow_meow.menu.float.print.build.floatconfig=FLOAT_PRINT_SINGLES_DOUBLES
electroniccats_meow_meow.menu.float.string=String uses separate singles and doubles
electroniccats_meow_meow.menu.float.string.build.floatconfig=FLOAT_STRING_SINGLES_DOUBLES
electroniccats_meow_meow.menu.float.both=Print & String use separate singles and doubles
electroniccats_meow_meow.menu.float.both.build.floatconfig=FLOAT_BOTH_SINGLES_DOUBLES
electroniccats_meow_meow.menu.config.disabled=config.h disabled
electroniccats_meow_meow.menu.config.disabled.build.buildconfig=CONFIG_H_DISABLED
electroniccats_meow_meow.menu.config.enabled=config.h enabled (mostly code size reductions)
electroniccats_meow_meow.menu.config.enabled.build.buildconfig=CONFIG_H_ENABLED
electroniccats_meow_meow.menu.clock.internal_usb=INTERNAL_USB_CALIBRATED_OSCILLATOR
electroniccats_meow_meow.menu.clock.internal_usb.build.clockconfig=CLOCKCONFIG_INTERNAL_USB
electroniccats_meow_meow.menu.clock.internal=INTERNAL_OSCILLATOR
electroniccats_meow_meow.menu.clock.internal.build.clockconfig=CLOCKCONFIG_INTERNAL
electroniccats_meow_meow.menu.clock.crystal_32k=32KHZ_CRYSTAL
electroniccats_meow_meow.menu.clock.crystal_32k.build.clockconfig=CLOCKCONFIG_32768HZ_CRYSTAL
electroniccats_meow_meow.menu.clock.crystal_hs=HIGH_SPEED_CRYSTAL
electroniccats_meow_meow.menu.clock.crystal_hs.build.clockconfig=CLOCKCONFIG_HS_CRYSTAL
electroniccats_meow_meow.menu.timer.timer_732Hz=732.4Hz (16-bit)
electroniccats_meow_meow.menu.timer.timer_732Hz.build.timerconfig=TIMER_732Hz
electroniccats_meow_meow.menu.timer.timer_366Hz=366.2Hz (16-bit)
electroniccats_meow_meow.menu.timer.timer_366Hz.build.timerconfig=TIMER_366Hz
electroniccats_meow_meow.menu.timer.timer_244Hz=244.1Hz (16-bit)
electroniccats_meow_meow.menu.timer.timer_244Hz.build.timerconfig=TIMER_244Hz
electroniccats_meow_meow.menu.timer.timer_183Hz=183.1Hz (16-bit)
electroniccats_meow_meow.menu.timer.timer_183Hz.build.timerconfig=TIMER_183Hz
electroniccats_meow_meow.menu.timer.timer_146Hz=146.5Hz (16-bit)
electroniccats_meow_meow.menu.timer.timer_146Hz.build.timerconfig=TIMER_146Hz
electroniccats_meow_meow.menu.timer.timer_122Hz=122.1Hz (16-bit)
electroniccats_meow_meow.menu.timer.timer_122Hz.build.timerconfig=TIMER_122Hz
electroniccats_meow_meow.menu.timer.timer_105Hz=104.6Hz (16-bit)
electroniccats_meow_meow.menu.timer.timer_105Hz.build.timerconfig=TIMER_105Hz
electroniccats_meow_meow.menu.timer.timer_81Hz=81.38Hz (16-bit)
electroniccats_meow_meow.menu.timer.timer_81Hz.build.timerconfig=TIMER_81Hz
electroniccats_meow_meow.menu.timer.timer_61Hz=61.04Hz (16-bit)
electroniccats_meow_meow.menu.timer.timer_61Hz.build.timerconfig=TIMER_61Hz
electroniccats_meow_meow.menu.timer.timer_31Hz=30.52Hz (16-bit)
electroniccats_meow_meow.menu.timer.timer_31Hz.build.timerconfig=TIMER_31Hz
electroniccats_meow_meow.menu.timer.timer_187500Hz=187500Hz (8-bit)
electroniccats_meow_meow.menu.timer.timer_187500Hz.build.timerconfig=TIMER_187500Hz
electroniccats_meow_meow.menu.timer.timer_93750Hz=93750Hz (8-bit)
electroniccats_meow_meow.menu.timer.timer_93750Hz.build.timerconfig=TIMER_93750Hz
electroniccats_meow_meow.menu.timer.timer_62500Hz=62500Hz (8-bit)
electroniccats_meow_meow.menu.timer.timer_62500Hz.build.timerconfig=TIMER_62500Hz
electroniccats_meow_meow.menu.timer.timer_37500Hz=37500Hz (8-bit)
electroniccats_meow_meow.menu.timer.timer_37500Hz.build.timerconfig=TIMER_37500Hz
electroniccats_meow_meow.menu.timer.timer_20833Hz=20833Hz (8-bit)
electroniccats_meow_meow.menu.timer.timer_20833Hz.build.timerconfig=TIMER_20833Hz
electroniccats_meow_meow.menu.timer.timer_12500Hz=12500Hz (8-bit)
electroniccats_meow_meow.menu.timer.timer_12500Hz.build.timerconfig=TIMER_12500Hz
electroniccats_meow_meow.menu.timer.timer_7500Hz=7500Hz (8-bit)
electroniccats_meow_meow.menu.timer.timer_7500Hz.build.timerconfig=TIMER_7500Hz
electroniccats_meow_meow.menu.timer.timer_4166Hz=4166Hz (8-bit)
electroniccats_meow_meow.menu.timer.timer_4166Hz.build.timerconfig=TIMER_4166Hz
electroniccats_meow_meow.menu.timer.timer_2930Hz=2930Hz (8-bit)
electroniccats_meow_meow.menu.timer.timer_2930Hz.build.timerconfig=TIMER_2930Hz
electroniccats_meow_meow.menu.timer.timer_1465Hz=1465Hz (8-bit, 16-bit for D51)
electroniccats_meow_meow.menu.timer.timer_1465Hz.build.timerconfig=TIMER_1465Hz
electroniccats_meow_meow.menu.bootloader.8kb=8KB_BOOTLOADER
electroniccats_meow_meow.menu.bootloader.8kb.build.bootloader_size=__8KB_BOOTLOADER__
electroniccats_meow_meow.menu.bootloader.8kb.build.ldscript_path=linker_scripts/gcc/8KB_Bootloader
electroniccats_meow_meow.menu.bootloader.8kb.upload.tool=bossac
electroniccats_meow_meow.menu.bootloader.8kb.upload.use_1200bps_touch=true
electroniccats_meow_meow.menu.bootloader.8kb.upload.wait_for_upload_port=true
electroniccats_meow_meow.menu.bootloader.8kb.upload.native_usb=true
electroniccats_meow_meow.menu.usb.cdc=CDC_ONLY
electroniccats_meow_meow.menu.usb.cdc.build.usbcom=CDC_ONLY
electroniccats_meow_meow.menu.usb.cdc.build.pid=0xBAB1
electroniccats_meow_meow.menu.usb.cdc_hid=CDC_HID
electroniccats_meow_meow.menu.usb.cdc_hid.build.usbcom=CDC_HID
electroniccats_meow_meow.menu.usb.cdc_hid.build.pid=0xBAB1
electroniccats_meow_meow.menu.usb.withcdc=WITH_CDC
electroniccats_meow_meow.menu.usb.withcdc.build.usbcom=WITH_CDC
electroniccats_meow_meow.menu.usb.withcdc.build.pid=0xBAB1
electroniccats_meow_meow.menu.usb.hid=HID_ONLY
electroniccats_meow_meow.menu.usb.hid.build.usbcom=HID_ONLY
electroniccats_meow_meow.menu.usb.hid.build.pid=0xBAB1
electroniccats_meow_meow.menu.usb.nocdc=WITHOUT_CDC
electroniccats_meow_meow.menu.usb.nocdc.build.usbcom=WITHOUT_CDC
electroniccats_meow_meow.menu.usb.nocdc.build.pid=0xBAB1
electroniccats_meow_meow.menu.usb.none=USB_DISABLED
electroniccats_meow_meow.menu.usb.none.build.usbcom=USB_DISABLED
electroniccats_meow_meow.menu.usb.none.build.pid=0xBAB1

# CatWAN Relay

electroniccats_relay_board.name=Electronic Cats CatWAN Relay Board
electroniccats_relay_board.vid.0=0x1209
electroniccats_relay_board.pid.0=0xBABA
electroniccats_relay_board.vid.1=0x1209
electroniccats_relay_board.pid.1=0xBABA
electroniccats_relay_board.upload.tool=bossac
electroniccats_relay_board.upload.protocol=sam-ba
electroniccats_relay_board.upload.maximum_size=262144
electroniccats_relay_board.upload.offset=0x2000
electroniccats_relay_board.upload.use_1200bps_touch=true
electroniccats_relay_board.upload.wait_for_upload_port=true
electroniccats_relay_board.upload.native_usb=true
electroniccats_relay_board.build.mcu=cortex-m0plus
electroniccats_relay_board.build.mathlib=arm_cortexM0l_math
electroniccats_relay_board.build.f_cpu=48000000L
electroniccats_relay_board.build.usb_product="CatWAN Relay Board"
electroniccats_relay_board.build.usb_manufacturer="Electronic Cats"
electroniccats_relay_board.build.board=catwan_relay_board
electroniccats_relay_board.build.core=arduino
electroniccats_relay_board.build.extra_flags=-DCRYSTALLESS -DARDUINO_SAMD_ZERO -D__SAMD21E18A__ -DARM_MATH_CM0PLUS {build.usb_flags}
electroniccats_relay_board.build.ldscript=flash_256KB.ld
electroniccats_relay_board.build.openocdscript=openocd_scripts/arduino_zero.cfg
electroniccats_relay_board.build.variant=catwan_relay_board
electroniccats_relay_board.build.variant_system_lib=
electroniccats_relay_board.build.vid=0x1209
electroniccats_relay_board.build.pid=0xBABA
electroniccats_relay_board.bootloader.tool=openocd
electroniccats_relay_board.bootloader.file=catwan_relay_board/bootloader-catwan_relay_board-v2.0.0.bin
electroniccats_relay_board.menu.float.default=Print & String use auto-promoted doubles only
electroniccats_relay_board.menu.float.default.build.floatconfig=FLOAT_BOTH_DOUBLES_ONLY
electroniccats_relay_board.menu.float.print=Print uses separate singles and doubles
electroniccats_relay_board.menu.float.print.build.floatconfig=FLOAT_PRINT_SINGLES_DOUBLES
electroniccats_relay_board.menu.float.string=String uses separate singles and doubles
electroniccats_relay_board.menu.float.string.build.floatconfig=FLOAT_STRING_SINGLES_DOUBLES
electroniccats_relay_board.menu.float.both=Print & String use separate singles and doubles
electroniccats_relay_board.menu.float.both.build.floatconfig=FLOAT_BOTH_SINGLES_DOUBLES
electroniccats_relay_board.menu.config.disabled=config.h disabled
electroniccats_relay_board.menu.config.disabled.build.buildconfig=CONFIG_H_DISABLED
electroniccats_relay_board.menu.config.enabled=config.h enabled (mostly code size reductions)
electroniccats_relay_board.menu.config.enabled.build.buildconfig=CONFIG_H_ENABLED
electroniccats_relay_board.menu.clock.internal_usb=INTERNAL_USB_CALIBRATED_OSCILLATOR
electroniccats_relay_board.menu.clock.internal_usb.build.clockconfig=CLOCKCONFIG_INTERNAL_USB
electroniccats_relay_board.menu.clock.internal=INTERNAL_OSCILLATOR
electroniccats_relay_board.menu.clock.internal.build.clockconfig=CLOCKCONFIG_INTERNAL
electroniccats_relay_board.menu.clock.crystal_32k=32KHZ_CRYSTAL
electroniccats_relay_board.menu.clock.crystal_32k.build.clockconfig=CLOCKCONFIG_32768HZ_CRYSTAL
electroniccats_relay_board.menu.clock.crystal_hs=HIGH_SPEED_CRYSTAL
electroniccats_relay_board.menu.clock.crystal_hs.build.clockconfig=CLOCKCONFIG_HS_CRYSTAL
electroniccats_relay_board.menu.timer.timer_732Hz=732.4Hz (16-bit)
electroniccats_relay_board.menu.timer.timer_732Hz.build.timerconfig=TIMER_732Hz
electroniccats_relay_board.menu.timer.timer_366Hz=366.2Hz (16-bit)
electroniccats_relay_board.menu.timer.timer_366Hz.build.timerconfig=TIMER_366Hz
electroniccats_relay_board.menu.timer.timer_244Hz=244.1Hz (16-bit)
electroniccats_relay_board.menu.timer.timer_244Hz.build.timerconfig=TIMER_244Hz
electroniccats_relay_board.menu.timer.timer_183Hz=183.1Hz (16-bit)
electroniccats_relay_board.menu.timer.timer_183Hz.build.timerconfig=TIMER_183Hz
electroniccats_relay_board.menu.timer.timer_146Hz=146.5Hz (16-bit)
electroniccats_relay_board.menu.timer.timer_146Hz.build.timerconfig=TIMER_146Hz
electroniccats_relay_board.menu.timer.timer_122Hz=122.1Hz (16-bit)
electroniccats_relay_board.menu.timer.timer_122Hz.build.timerconfig=TIMER_122Hz
electroniccats_relay_board.menu.timer.timer_105Hz=104.6Hz (16-bit)
electroniccats_relay_board.menu.timer.timer_105Hz.build.timerconfig=TIMER_105Hz
electroniccats_relay_board.menu.timer.timer_81Hz=81.38Hz (16-bit)
electroniccats_relay_board.menu.timer.timer_81Hz.build.timerconfig=TIMER_81Hz
electroniccats_relay_board.menu.timer.timer_61Hz=61.04Hz (16-bit)
electroniccats_relay_board.menu.timer.timer_61Hz.build.timerconfig=TIMER_61Hz
electroniccats_relay_board.menu.timer.timer_31Hz=30.52Hz (16-bit)
electroniccats_relay_board.menu.timer.timer_31Hz.build.timerconfig=TIMER_31Hz
electroniccats_relay_board.menu.timer.timer_187500Hz=187500Hz (8-bit)
electroniccats_relay_board.menu.timer.timer_187500Hz.build.timerconfig=TIMER_187500Hz
electroniccats_relay_board.menu.timer.timer_93750Hz=93750Hz (8-bit)
electroniccats_relay_board.menu.timer.timer_93750Hz.build.timerconfig=TIMER_93750Hz
electroniccats_relay_board.menu.timer.timer_62500Hz=62500Hz (8-bit)
electroniccats_relay_board.menu.timer.timer_62500Hz.build.timerconfig=TIMER_62500Hz
electroniccats_relay_board.menu.timer.timer_37500Hz=37500Hz (8-bit)
electroniccats_relay_board.menu.timer.timer_37500Hz.build.timerconfig=TIMER_37500Hz
electroniccats_relay_board.menu.timer.timer_20833Hz=20833Hz (8-bit)
electroniccats_relay_board.menu.timer.timer_20833Hz.build.timerconfig=TIMER_20833Hz
electroniccats_relay_board.menu.timer.timer_12500Hz=12500Hz (8-bit)
electroniccats_relay_board.menu.timer.timer_12500Hz.build.timerconfig=TIMER_12500Hz
electroniccats_relay_board.menu.timer.timer_7500Hz=7500Hz (8-bit)
electroniccats_relay_board.menu.timer.timer_7500Hz.build.timerconfig=TIMER_7500Hz
electroniccats_relay_board.menu.timer.timer_4166Hz=4166Hz (8-bit)
electroniccats_relay_board.menu.timer.timer_4166Hz.build.timerconfig=TIMER_4166Hz
electroniccats_relay_board.menu.timer.timer_2930Hz=2930Hz (8-bit)
electroniccats_relay_board.menu.timer.timer_2930Hz.build.timerconfig=TIMER_2930Hz
electroniccats_relay_board.menu.timer.timer_1465Hz=1465Hz (8-bit, 16-bit for D51)
electroniccats_relay_board.menu.timer.timer_1465Hz.build.timerconfig=TIMER_1465Hz
electroniccats_relay_board.menu.bootloader.8kb=8KB_BOOTLOADER
electroniccats_relay_board.menu.bootloader.8kb.build.bootloader_size=__8KB_BOOTLOADER__
electroniccats_relay_board.menu.bootloader.8kb.build.ldscript_path=linker_scripts/gcc/8KB_Bootloader
electroniccats_relay_board.menu.bootloader.8kb.upload.tool=bossac
electroniccats_relay_board.menu.bootloader.8kb.upload.use_1200bps_touch=true
electroniccats_relay_board.menu.bootloader.8kb.upload.wait_for_upload_port=true
electroniccats_relay_board.menu.bootloader.8kb.upload.native_usb=true
electroniccats_relay_board.menu.usb.cdc=CDC_ONLY
electroniccats_relay_board.menu.usb.cdc.build.usbcom=CDC_ONLY
electroniccats_relay_board.menu.usb.cdc.build.pid=0xBABA
electroniccats_relay_board.menu.usb.cdc_hid=CDC_HID
electroniccats_relay_board.menu.usb.cdc_hid.build.usbcom=CDC_HID
electroniccats_relay_board.menu.usb.cdc_hid.build.pid=0xBABA
electroniccats_relay_board.menu.usb.withcdc=WITH_CDC
electroniccats_relay_board.menu.usb.withcdc.build.usbcom=WITH_CDC
electroniccats_relay_board.menu.usb.withcdc.build.pid=0xBABA
electroniccats_relay_board.menu.usb.hid=HID_ONLY
electroniccats_relay_board.menu.usb.hid.build.usbcom=HID_ONLY
electroniccats_relay_board.menu.usb.hid.build.pid=0xBABA
electroniccats_relay_board.menu.usb.nocdc=WITHOUT_CDC
electroniccats_relay_board.menu.usb.nocdc.build.usbcom=WITHOUT_CDC
electroniccats_relay_board.menu.usb.nocdc.build.pid=0xBABA
electroniccats_relay_board.menu.usb.none=USB_DISABLED
electroniccats_relay_board.menu.usb.none.build.usbcom=USB_DISABLED
electroniccats_relay_board.menu.usb.none.build.pid=0xBABA

# CatWAN Citizen

