ElectronicCats/Arduino_Boards_Index/electroniccats/samd_advanced/boards.txt
electroniccats_tracker.name=Electronic Cats CatWAN Tracker
electroniccats_tracker.vid.0=0x1209
electroniccats_tracker.pid.0=0xBAB9
electroniccats_tracker.vid.1=0x1209
electroniccats_tracker.pid.1=0xBAB9
electroniccats_tracker.upload.tool=bossac
electroniccats_tracker.upload.protocol=sam-ba
electroniccats_tracker.upload.maximum_size=253952
electroniccats_tracker.upload.offset=0x2000
electroniccats_tracker.upload.use_1200bps_touch=true
electroniccats_tracker.upload.wait_for_upload_port=true
electroniccats_tracker.upload.native_usb=true
electroniccats_tracker.build.mcu=cortex-m0plus
electroniccats_tracker.build.mathlib=arm_cortexM0l_math
electroniccats_tracker.build.f_cpu=48000000L
electroniccats_tracker.build.usb_product="CatWAN Tracker"
electroniccats_tracker.build.usb_manufacturer="Electronic Cats"
electroniccats_tracker.build.board=catwan_tracker
electroniccats_tracker.build.core=arduino
electroniccats_tracker.build.extra_flags=-DCRYSTALLESS -DARDUINO_SAMD_ZERO -D__SAMD21E18A__ -DARM_MATH_CM0PLUS {build.usb_flags}
electroniccats_tracker.build.ldscript=flash_256KB.ld
electroniccats_tracker.build.openocdscript=openocd_scripts/SAMD21E18A.cfg
electroniccats_tracker.build.variant=catwan_tracker
electroniccats_tracker.build.variant_system_lib=
electroniccats_tracker.build.vid=0x1209
electroniccats_tracker.build.pid=0xBAB9
electroniccats_tracker.bootloader.tool=openocd
electroniccats_tracker.bootloader.file=catwan_tracker/bootloader-tracker-v3.3.0.bin
electroniccats_tracker.menu.float.default=Print & String use auto-promoted doubles only
electroniccats_tracker.menu.float.default.build.floatconfig=FLOAT_BOTH_DOUBLES_ONLY
electroniccats_tracker.menu.float.print=Print uses separate singles and doubles
electroniccats_tracker.menu.float.print.build.floatconfig=FLOAT_PRINT_SINGLES_DOUBLES
electroniccats_tracker.menu.float.string=String uses separate singles and doubles
electroniccats_tracker.menu.float.string.build.floatconfig=FLOAT_STRING_SINGLES_DOUBLES
electroniccats_tracker.menu.float.both=Print & String use separate singles and doubles
electroniccats_tracker.menu.float.both.build.floatconfig=FLOAT_BOTH_SINGLES_DOUBLES
electroniccats_tracker.menu.config.disabled=config.h disabled
electroniccats_tracker.menu.config.disabled.build.buildconfig=CONFIG_H_DISABLED
electroniccats_tracker.menu.config.enabled=config.h enabled (mostly code size reductions)
electroniccats_tracker.menu.config.enabled.build.buildconfig=CONFIG_H_ENABLED
electroniccats_tracker.menu.clock.internal_usb=INTERNAL_USB_CALIBRATED_OSCILLATOR
electroniccats_tracker.menu.clock.internal_usb.build.clockconfig=CLOCKCONFIG_INTERNAL_USB
electroniccats_tracker.menu.clock.internal=INTERNAL_OSCILLATOR
electroniccats_tracker.menu.clock.internal.build.clockconfig=CLOCKCONFIG_INTERNAL
electroniccats_tracker.menu.clock.crystal_32k=32KHZ_CRYSTAL
electroniccats_tracker.menu.clock.crystal_32k.build.clockconfig=CLOCKCONFIG_32768HZ_CRYSTAL
electroniccats_tracker.menu.clock.crystal_hs=HIGH_SPEED_CRYSTAL
electroniccats_tracker.menu.clock.crystal_hs.build.clockconfig=CLOCKCONFIG_HS_CRYSTAL
electroniccats_tracker.menu.timer.timer_732Hz=732.4Hz (16-bit)
electroniccats_tracker.menu.timer.timer_732Hz.build.timerconfig=TIMER_732Hz
electroniccats_tracker.menu.timer.timer_366Hz=366.2Hz (16-bit)
electroniccats_tracker.menu.timer.timer_366Hz.build.timerconfig=TIMER_366Hz
electroniccats_tracker.menu.timer.timer_244Hz=244.1Hz (16-bit)
electroniccats_tracker.menu.timer.timer_244Hz.build.timerconfig=TIMER_244Hz
electroniccats_tracker.menu.timer.timer_183Hz=183.1Hz (16-bit)
electroniccats_tracker.menu.timer.timer_183Hz.build.timerconfig=TIMER_183Hz
electroniccats_tracker.menu.timer.timer_146Hz=146.5Hz (16-bit)
electroniccats_tracker.menu.timer.timer_146Hz.build.timerconfig=TIMER_146Hz
electroniccats_tracker.menu.timer.timer_122Hz=122.1Hz (16-bit)
electroniccats_tracker.menu.timer.timer_122Hz.build.timerconfig=TIMER_122Hz
electroniccats_tracker.menu.timer.timer_105Hz=104.6Hz (16-bit)
electroniccats_tracker.menu.timer.timer_105Hz.build.timerconfig=TIMER_105Hz
electroniccats_tracker.menu.timer.timer_81Hz=81.38Hz (16-bit)
electroniccats_tracker.menu.timer.timer_81Hz.build.timerconfig=TIMER_81Hz
electroniccats_tracker.menu.timer.timer_61Hz=61.04Hz (16-bit)
electroniccats_tracker.menu.timer.timer_61Hz.build.timerconfig=TIMER_61Hz
electroniccats_tracker.menu.timer.timer_31Hz=30.52Hz (16-bit)
electroniccats_tracker.menu.timer.timer_31Hz.build.timerconfig=TIMER_31Hz
electroniccats_tracker.menu.timer.timer_187500Hz=187500Hz (8-bit)
electroniccats_tracker.menu.timer.timer_187500Hz.build.timerconfig=TIMER_187500Hz
electroniccats_tracker.menu.timer.timer_93750Hz=93750Hz (8-bit)
electroniccats_tracker.menu.timer.timer_93750Hz.build.timerconfig=TIMER_93750Hz
electroniccats_tracker.menu.timer.timer_62500Hz=62500Hz (8-bit)
electroniccats_tracker.menu.timer.timer_62500Hz.build.timerconfig=TIMER_62500Hz
electroniccats_tracker.menu.timer.timer_37500Hz=37500Hz (8-bit)
electroniccats_tracker.menu.timer.timer_37500Hz.build.timerconfig=TIMER_37500Hz
electroniccats_tracker.menu.timer.timer_20833Hz=20833Hz (8-bit)
electroniccats_tracker.menu.timer.timer_20833Hz.build.timerconfig=TIMER_20833Hz
electroniccats_tracker.menu.timer.timer_12500Hz=12500Hz (8-bit)
electroniccats_tracker.menu.timer.timer_12500Hz.build.timerconfig=TIMER_12500Hz
electroniccats_tracker.menu.timer.timer_7500Hz=7500Hz (8-bit)
electroniccats_tracker.menu.timer.timer_7500Hz.build.timerconfig=TIMER_7500Hz
electroniccats_tracker.menu.timer.timer_4166Hz=4166Hz (8-bit)
electroniccats_tracker.menu.timer.timer_4166Hz.build.timerconfig=TIMER_4166Hz
electroniccats_tracker.menu.timer.timer_2930Hz=2930Hz (8-bit)
electroniccats_tracker.menu.timer.timer_2930Hz.build.timerconfig=TIMER_2930Hz
electroniccats_tracker.menu.timer.timer_1465Hz=1465Hz (8-bit, 16-bit for D51)
electroniccats_tracker.menu.timer.timer_1465Hz.build.timerconfig=TIMER_1465Hz
electroniccats_tracker.menu.bootloader.8kb=8KB_BOOTLOADER
electroniccats_tracker.menu.bootloader.8kb.build.bootloader_size=__8KB_BOOTLOADER__
electroniccats_tracker.menu.bootloader.8kb.build.ldscript_path=linker_scripts/gcc/8KB_Bootloader
electroniccats_tracker.menu.bootloader.8kb.upload.tool=bossac
electroniccats_tracker.menu.bootloader.8kb.upload.use_1200bps_touch=true
electroniccats_tracker.menu.bootloader.8kb.upload.wait_for_upload_port=true
electroniccats_tracker.menu.bootloader.8kb.upload.native_usb=true
electroniccats_tracker.menu.usb.cdc=CDC_ONLY
electroniccats_tracker.menu.usb.cdc.build.usbcom=CDC_ONLY
electroniccats_tracker.menu.usb.cdc.build.pid=0xBAB9
electroniccats_tracker.menu.usb.cdc_hid=CDC_HID
electroniccats_tracker.menu.usb.cdc_hid.build.usbcom=CDC_HID
electroniccats_tracker.menu.usb.cdc_hid.build.pid=0xBAB9
electroniccats_tracker.menu.usb.withcdc=WITH_CDC
electroniccats_tracker.menu.usb.withcdc.build.usbcom=WITH_CDC
electroniccats_tracker.menu.usb.withcdc.build.pid=0xBAB9
electroniccats_tracker.menu.usb.hid=HID_ONLY
electroniccats_tracker.menu.usb.hid.build.usbcom=HID_ONLY
electroniccats_tracker.menu.usb.hid.build.pid=0xBAB9
electroniccats_tracker.menu.usb.nocdc=WITHOUT_CDC
electroniccats_tracker.menu.usb.nocdc.build.usbcom=WITHOUT_CDC
electroniccats_tracker.menu.usb.nocdc.build.pid=0xBAB9
electroniccats_tracker.menu.usb.none=USB_DISABLED
electroniccats_tracker.menu.usb.none.build.usbcom=USB_DISABLED
electroniccats_tracker.menu.usb.none.build.pid=0xBAB9

# NFC Copy Cat

electroniccats_nfc_copy_cat.name=Electronic Cats NCF Copy Cat
electroniccats_nfc_copy_cat.vid.0=0x1209
electroniccats_nfc_copy_cat.pid.0=0xBAB8
electroniccats_nfc_copy_cat.vid.1=0x1209
electroniccats_nfc_copy_cat.pid.1=0xBAB8
electroniccats_nfc_copy_cat.upload.tool=bossac
electroniccats_nfc_copy_cat.upload.protocol=sam-ba
electroniccats_nfc_copy_cat.upload.maximum_size=262144
electroniccats_nfc_copy_cat.upload.offset=0x2000
electroniccats_nfc_copy_cat.upload.use_1200bps_touch=true
electroniccats_nfc_copy_cat.upload.wait_for_upload_port=true
electroniccats_nfc_copy_cat.upload.native_usb=true
electroniccats_nfc_copy_cat.build.mcu=cortex-m0plus
electroniccats_nfc_copy_cat.build.mathlib=arm_cortexM0l_math
electroniccats_nfc_copy_cat.build.f_cpu=48000000L
electroniccats_nfc_copy_cat.build.usb_product="NFC Copy Cat"
electroniccats_nfc_copy_cat.build.usb_manufacturer="Electronic Cats"
electroniccats_nfc_copy_cat.build.board=nfc_copy_cat
electroniccats_nfc_copy_cat.build.core=arduino
electroniccats_nfc_copy_cat.build.extra_flags=-DCRYSTALLESS -DARDUINO_SAMD_ZERO -D__SAMD21E18A__ -DARM_MATH_CM0PLUS {build.usb_flags}
electroniccats_nfc_copy_cat.build.ldscript=flash_256KB.ld
electroniccats_nfc_copy_cat.build.openocdscript=openocd_scripts/arduino_zero.cfg
electroniccats_nfc_copy_cat.build.variant=nfc_copy_cat
electroniccats_nfc_copy_cat.build.variant_system_lib=
electroniccats_nfc_copy_cat.build.vid=0x1209
electroniccats_nfc_copy_cat.build.pid=0xBAB8
electroniccats_nfc_copy_cat.bootloader.tool=openocd
electroniccats_nfc_copy_cat.bootloader.file=nfc_copy_cat/bootloader-nfc_copy_cat-v2.0.0.bin
electroniccats_nfc_copy_cat.menu.float.default=Print & String use auto-promoted doubles only
electroniccats_nfc_copy_cat.menu.float.default.build.floatconfig=FLOAT_BOTH_DOUBLES_ONLY
electroniccats_nfc_copy_cat.menu.float.print=Print uses separate singles and doubles
electroniccats_nfc_copy_cat.menu.float.print.build.floatconfig=FLOAT_PRINT_SINGLES_DOUBLES
electroniccats_nfc_copy_cat.menu.float.string=String uses separate singles and doubles
electroniccats_nfc_copy_cat.menu.float.string.build.floatconfig=FLOAT_STRING_SINGLES_DOUBLES
electroniccats_nfc_copy_cat.menu.float.both=Print & String use separate singles and doubles
electroniccats_nfc_copy_cat.menu.float.both.build.floatconfig=FLOAT_BOTH_SINGLES_DOUBLES
electroniccats_nfc_copy_cat.menu.config.disabled=config.h disabled
electroniccats_nfc_copy_cat.menu.config.disabled.build.buildconfig=CONFIG_H_DISABLED
electroniccats_nfc_copy_cat.menu.config.enabled=config.h enabled (mostly code size reductions)
electroniccats_nfc_copy_cat.menu.config.enabled.build.buildconfig=CONFIG_H_ENABLED
electroniccats_nfc_copy_cat.menu.clock.internal_usb=INTERNAL_USB_CALIBRATED_OSCILLATOR
electroniccats_nfc_copy_cat.menu.clock.internal_usb.build.clockconfig=CLOCKCONFIG_INTERNAL_USB
electroniccats_nfc_copy_cat.menu.clock.internal=INTERNAL_OSCILLATOR
electroniccats_nfc_copy_cat.menu.clock.internal.build.clockconfig=CLOCKCONFIG_INTERNAL
electroniccats_nfc_copy_cat.menu.clock.crystal_32k=32KHZ_CRYSTAL
electroniccats_nfc_copy_cat.menu.clock.crystal_32k.build.clockconfig=CLOCKCONFIG_32768HZ_CRYSTAL
electroniccats_nfc_copy_cat.menu.clock.crystal_hs=HIGH_SPEED_CRYSTAL
electroniccats_nfc_copy_cat.menu.clock.crystal_hs.build.clockconfig=CLOCKCONFIG_HS_CRYSTAL
electroniccats_nfc_copy_cat.menu.timer.timer_732Hz=732.4Hz (16-bit)
electroniccats_nfc_copy_cat.menu.timer.timer_732Hz.build.timerconfig=TIMER_732Hz
electroniccats_nfc_copy_cat.menu.timer.timer_366Hz=366.2Hz (16-bit)
electroniccats_nfc_copy_cat.menu.timer.timer_366Hz.build.timerconfig=TIMER_366Hz
electroniccats_nfc_copy_cat.menu.timer.timer_244Hz=244.1Hz (16-bit)
electroniccats_nfc_copy_cat.menu.timer.timer_244Hz.build.timerconfig=TIMER_244Hz
electroniccats_nfc_copy_cat.menu.timer.timer_183Hz=183.1Hz (16-bit)
electroniccats_nfc_copy_cat.menu.timer.timer_183Hz.build.timerconfig=TIMER_183Hz
electroniccats_nfc_copy_cat.menu.timer.timer_146Hz=146.5Hz (16-bit)
electroniccats_nfc_copy_cat.menu.timer.timer_146Hz.build.timerconfig=TIMER_146Hz
electroniccats_nfc_copy_cat.menu.timer.timer_122Hz=122.1Hz (16-bit)
electroniccats_nfc_copy_cat.menu.timer.timer_122Hz.build.timerconfig=TIMER_122Hz
electroniccats_nfc_copy_cat.menu.timer.timer_105Hz=104.6Hz (16-bit)
electroniccats_nfc_copy_cat.menu.timer.timer_105Hz.build.timerconfig=TIMER_105Hz
electroniccats_nfc_copy_cat.menu.timer.timer_81Hz=81.38Hz (16-bit)
electroniccats_nfc_copy_cat.menu.timer.timer_81Hz.build.timerconfig=TIMER_81Hz
electroniccats_nfc_copy_cat.menu.timer.timer_61Hz=61.04Hz (16-bit)
electroniccats_nfc_copy_cat.menu.timer.timer_61Hz.build.timerconfig=TIMER_61Hz
electroniccats_nfc_copy_cat.menu.timer.timer_31Hz=30.52Hz (16-bit)
electroniccats_nfc_copy_cat.menu.timer.timer_31Hz.build.timerconfig=TIMER_31Hz
electroniccats_nfc_copy_cat.menu.timer.timer_187500Hz=187500Hz (8-bit)
electroniccats_nfc_copy_cat.menu.timer.timer_187500Hz.build.timerconfig=TIMER_187500Hz
electroniccats_nfc_copy_cat.menu.timer.timer_93750Hz=93750Hz (8-bit)
electroniccats_nfc_copy_cat.menu.timer.timer_93750Hz.build.timerconfig=TIMER_93750Hz
electroniccats_nfc_copy_cat.menu.timer.timer_62500Hz=62500Hz (8-bit)
electroniccats_nfc_copy_cat.menu.timer.timer_62500Hz.build.timerconfig=TIMER_62500Hz
electroniccats_nfc_copy_cat.menu.timer.timer_37500Hz=37500Hz (8-bit)
electroniccats_nfc_copy_cat.menu.timer.timer_37500Hz.build.timerconfig=TIMER_37500Hz
electroniccats_nfc_copy_cat.menu.timer.timer_20833Hz=20833Hz (8-bit)
electroniccats_nfc_copy_cat.menu.timer.timer_20833Hz.build.timerconfig=TIMER_20833Hz
electroniccats_nfc_copy_cat.menu.timer.timer_12500Hz=12500Hz (8-bit)
electroniccats_nfc_copy_cat.menu.timer.timer_12500Hz.build.timerconfig=TIMER_12500Hz
electroniccats_nfc_copy_cat.menu.timer.timer_7500Hz=7500Hz (8-bit)
electroniccats_nfc_copy_cat.menu.timer.timer_7500Hz.build.timerconfig=TIMER_7500Hz
electroniccats_nfc_copy_cat.menu.timer.timer_4166Hz=4166Hz (8-bit)
electroniccats_nfc_copy_cat.menu.timer.timer_4166Hz.build.timerconfig=TIMER_4166Hz
electroniccats_nfc_copy_cat.menu.timer.timer_2930Hz=2930Hz (8-bit)
electroniccats_nfc_copy_cat.menu.timer.timer_2930Hz.build.timerconfig=TIMER_2930Hz
electroniccats_nfc_copy_cat.menu.timer.timer_1465Hz=1465Hz (8-bit, 16-bit for D51)
electroniccats_nfc_copy_cat.menu.timer.timer_1465Hz.build.timerconfig=TIMER_1465Hz
electroniccats_nfc_copy_cat.menu.bootloader.8kb=8KB_BOOTLOADER
electroniccats_nfc_copy_cat.menu.bootloader.8kb.build.bootloader_size=__8KB_BOOTLOADER__
electroniccats_nfc_copy_cat.menu.bootloader.8kb.build.ldscript_path=linker_scripts/gcc/8KB_Bootloader
electroniccats_nfc_copy_cat.menu.bootloader.8kb.upload.tool=bossac
electroniccats_nfc_copy_cat.menu.bootloader.8kb.upload.use_1200bps_touch=true
electroniccats_nfc_copy_cat.menu.bootloader.8kb.upload.wait_for_upload_port=true
electroniccats_nfc_copy_cat.menu.bootloader.8kb.upload.native_usb=true
electroniccats_nfc_copy_cat.menu.usb.cdc=CDC_ONLY
electroniccats_nfc_copy_cat.menu.usb.cdc.build.usbcom=CDC_ONLY
electroniccats_nfc_copy_cat.menu.usb.cdc.build.pid=0xBAB8
electroniccats_nfc_copy_cat.menu.usb.cdc_hid=CDC_HID
electroniccats_nfc_copy_cat.menu.usb.cdc_hid.build.usbcom=CDC_HID
electroniccats_nfc_copy_cat.menu.usb.cdc_hid.build.pid=0xBAB8
electroniccats_nfc_copy_cat.menu.usb.withcdc=WITH_CDC
electroniccats_nfc_copy_cat.menu.usb.withcdc.build.usbcom=WITH_CDC
electroniccats_nfc_copy_cat.menu.usb.withcdc.build.pid=0xBAB8
electroniccats_nfc_copy_cat.menu.usb.hid=HID_ONLY
electroniccats_nfc_copy_cat.menu.usb.hid.build.usbcom=HID_ONLY
electroniccats_nfc_copy_cat.menu.usb.hid.build.pid=0xBAB8
electroniccats_nfc_copy_cat.menu.usb.nocdc=WITHOUT_CDC
electroniccats_nfc_copy_cat.menu.usb.nocdc.build.usbcom=WITHOUT_CDC
electroniccats_nfc_copy_cat.menu.usb.nocdc.build.pid=0xBAB8
electroniccats_nfc_copy_cat.menu.usb.none=USB_DISABLED
electroniccats_nfc_copy_cat.menu.usb.none.build.usbcom=USB_DISABLED
electroniccats_nfc_copy_cat.menu.usb.none.build.pid=0xBAB8

